# MajorNumberOfWires Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType..::..MajorNumberOfWires Property
FabricSheetType Class See Also
---
The number of wires used in the major direction (includes the first and last wires).
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int MajorNumberOfWires { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MajorNumberOfWires As Integer
	Get
```

Visual C++
---
```text
public:
property int MajorNumberOfWires {
	int get ();
}
```

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace